Tekla Open API Reference for Tekla Structures 2025
GeneralConnectiveGeometryException Constructor
 Initializes a new instance of the GeneralConnectiveGeometryException class with "Failed to create or modify connective geometry" message.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GeneralConnectiveGeometryException()
Public Sub New
See Also
Reference
GeneralConnectiveGeometryException Class
Tekla.Structures.Model Namespace